The only values are True and False

In [6]:
print("hello")

hello

In [8]:
True

True

In [10]:
False

False

In [12]:
3 > 2

True

In [14]:
3 < 2

False

In [16]:
3 != 2

True

In [20]:
3 == 2

False

Assignment to a variable =
Comparison  ==

Equality ==

In [26]:
3 == 3.0

True

In [28]:
3 is 3

<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
/var/folders/pz/p8lt49b526gd6wk8gcqbfl440000gn/T/ipykernel_87463/30664588.py:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
  3 is 3

True

In [30]:
3 is 3.0

<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
/var/folders/pz/p8lt49b526gd6wk8gcqbfl440000gn/T/ipykernel_87463/344507504.py:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
  3 is 3.0

False

In [32]:
3 == "3"

False

In [34]:
3 >= 3

True

if

In [36]:
num = 10

In [39]:
if num > 5:
    print("Big number")

Big number

In [41]:
num = 2
if num > 5:
    print("Big number")

In [43]:
num = 10
if num > 5:
    int("3.0")

ValueError: invalid literal for int() with base 10: '3.0'

In [51]:
num = 2
if num > 5:
    print("big num")
    print("this is a second line")
    biggerNum = num * 5
    print(f"This is a bigger num: {biggerNum}")
else:
    print("small num")
    print("this is an alternative second line")
    smallerNum = num / 5
    print(f"This is a bigger num: {smallerNum}")
print("This is outside the if statement")

small num
this is an alternative second line
This is a bigger num: 0.4
This is outside the if statement

## Libraries

code that others write that we can use

In [58]:
import pandas

In [64]:
data = pandas.read_csv("GSAF5.csv", low_memory= False)

In [62]:
data

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
0,10 Nov-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Port Noarlunga,Free diving,Bridgette O’Shannessy,F,32,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,05 Nov-2023,2023.0,Unprovoked,USA,Florida,"Juno Beach, Palm Beach County",Swimming,Steven Reinhardt,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,03 Nov-2023,2023.0,Unprovoked,AUSTRALIA,Westerm Australia,Peak Island,Spearfishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,02 Nov-2023,2023.0,Unprovoked,NEW ZEALAND,North Island,Cape Pallister,Free diving,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Reported 02 Nov-2023,2023.0,Questionable,EGYPT,Southern Red Sea,Fury Shoal,Scuba diving,Gary Virgo,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
38976,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38977,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38978,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38979,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38980,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [66]:
type(data)

pandas.core.frame.DataFrame

In [68]:
data.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
0,10 Nov-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Port Noarlunga,Free diving,Bridgette O’Shannessy,F,32,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,05 Nov-2023,2023.0,Unprovoked,USA,Florida,"Juno Beach, Palm Beach County",Swimming,Steven Reinhardt,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,03 Nov-2023,2023.0,Unprovoked,AUSTRALIA,Westerm Australia,Peak Island,Spearfishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,02 Nov-2023,2023.0,Unprovoked,NEW ZEALAND,North Island,Cape Pallister,Free diving,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Reported 02 Nov-2023,2023.0,Questionable,EGYPT,Southern Red Sea,Fury Shoal,Scuba diving,Gary Virgo,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [70]:
data["Country"]

0          AUSTRALIA
1                USA
2          AUSTRALIA
3        NEW ZEALAND
4              EGYPT
            ...
38976            NaN
38977            NaN
38978            NaN
38979            NaN
38980            NaN
Name: Country, Length: 38981, dtype: object

In [74]:
data["Country"] == "AUSTRALIA"

0         True
1        False
2         True
3        False
4        False
         ...
38976    False
38977    False
38978    False
38979    False
38980    False
Name: Country, Length: 38981, dtype: bool

In [76]:
data[data["Country"] == "AUSTRALIA"]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
0,10 Nov-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Port Noarlunga,Free diving,Bridgette O’Shannessy,F,32,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,03 Nov-2023,2023.0,Unprovoked,AUSTRALIA,Westerm Australia,Peak Island,Spearfishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,31 Oct-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Streaky Bay,Surfing,Todd Gendle,M,55,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,21 Oct-2023,2023.0,Watercraft,AUSTRALIA,Western Australia,"Alexander Bay, Esperance",Fishing,Inflatatable dinghy,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,01 Oct-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Beachport,Swimming,Pamela Cook,F,64,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6908,Before 1906,0.0,Unprovoked,AUSTRALIA,NaN,NaN,Fishing,fisherman,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6909,Before 1906,0.0,Unprovoked,AUSTRALIA,NaN,NaN,Fishing,fisherman,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6910,Before 1906,0.0,Unprovoked,AUSTRALIA,New South Wales,,Swimming,Arab boy,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6911,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6912,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [78]:
data[data["Country"] == "IRELAND"]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
553,01-Sep-2018,2018.0,Provoked,IRELAND,County Cork,NaN,Fishing,Robert Malcolmson,M,40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5893,15-Jul-1917,1917.0,Sea Disaster,IRELAND,Off Ireland,82 miles from Fastnet,Ship Mariston torpedoed & sunk,NaN,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [78]:
data[data["Country"] == "IRELAND"]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
553,01-Sep-2018,2018.0,Provoked,IRELAND,County Cork,NaN,Fishing,Robert Malcolmson,M,40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5893,15-Jul-1917,1917.0,Sea Disaster,IRELAND,Off Ireland,82 miles from Fastnet,Ship Mariston torpedoed & sunk,NaN,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [78]:
data[data["Country"] == "IRELAND"]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
553,01-Sep-2018,2018.0,Provoked,IRELAND,County Cork,NaN,Fishing,Robert Malcolmson,M,40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5893,15-Jul-1917,1917.0,Sea Disaster,IRELAND,Off Ireland,82 miles from Fastnet,Ship Mariston torpedoed & sunk,NaN,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [80]:
hours = input("How many hours did you work")
hours = int(hours)
if hours > 40:
    rate = 1.5
else:
    rate = 2.75
pay = float(hours) * rate
print(pay)

How many hours did you work 41

61.5